Repository: d6lts/aes
Catalog: translations/*.po
Languages: hu

source: Password
hu: Jelszó

source: Save
hu: Mentés

source: Both
hu: Mindkettő

source: Key
hu: Kulcs

source: AES settings
hu: AES beállítások

source: Configure the AES encryption module.
hu: Az AES titkosító modul beállítása.

source: View password
hu: Jelszó megtekintése

source: The keyfile %keyfile_path is not writable. This module needs to be able to write to this file to update the encryption key.
hu: %keyfile_path kulcsfájl nem írható. Ennek a modulnak szüksége van arra, hogy írni tudja ezt a fájlt, hogy frissíthesse a titkosítási kulcsot.

source: Create AES passwords
hu: AES jelszavak létrehozása

source: Method for viewing passwords
hu: Jelszavak megtekintésének módja

source: Own page
hu: Saját oldal

source: Cipher
hu: Rejtjel

source: Key storage method
hu: Kulcstárolási mód

source: If possible, you should use the file storage method and assign a path below.
hu: Ha lehetséges, akkor célszerű a fájlban tárolási módot választani, és az útvonalat lejjebb megadni.

source: Path to keyfile
hu: Kulcsfájl útvonala

source: The path, including the filename, of the file in which to store your key. The access restrictions on this file should be set as high as possible while still allowing PHP read/write access.
hu: A fájl útvonala, beleértve a fájlnevet is, ahová a kulcs tárolásra kerül. Ezen a fájlon a lehető legmagasabb elérési korlátozást kell alkalmazni, de a PHP számára maradjon meg az olvasási, és az írási hozzáférés.

source: The key for your encryption system. You normally don't need to worry about this since this module will generate a key for you if none is specified. However you have the option of using your own custom key here.
hu: A titkosítási rendszer kulcsa. Normál esetben nem kell aggódni emiatt, mert a modul létrehoz egy kulcsot, ha nincs megadva. Tehát ez csak egy lehetőség a saját, egyedi kulcs használatához.

source: Confirm key
hu: Kulcs megerősítése

source: The encryption keys didn't match.
hu: A titkosítási kulcsok nem egyeznek meg.

source: Can't write to the specified location.
hu: A megadott hely nem írható.

source: Switching key storage method to !method.
hu: Kulcstárolási mód váltás erre: !method.

source: Updated the passwords of !updates_num users because of a change in cipher.
hu: A rejtjel változása miatt !updates_num felhasználó jelszava frissítve lett.

source: Failed to write new encryption key! Aborting.
hu: Hiba történt az új titkosítási kulcs írásakor! Megszakítás.

source: Key changed.
hu: A kulcs megváltozott.

source: Updated the passwords of !updates_num users because of a change in key.
hu: A kulcs változása miatt !updates_num felhasználó jelszava frissítve lett.

source: Couldn't update AES password since it's too long.
hu: Nem lehet frissíteni az AES jelszót, mert az túl hosszú.

source: Show password
hu: Jelszó megmutatása

source: AES module made a new key since one couldn't be found by using the database storage method.
hu: Az AES modul egy új kulcsot készített, mert nem talált egyet sem az adatbázis tárolási mód használatával.

source: AES module made a new key since one couldn't be found by using the file storage method.
hu: Az AES modul egy új kulcsot készített, mert nem talált egyet sem a fájl tárolási mód használatával.

source: Unknown storage method in AES module.
hu: Ismeretlen tárolási mód az AES modulban.

source: Couldn't delete keyfile!
hu: A kulcsfájl törlése nem sikerült!

source: No initialization vector found while trying to encrypt! This could be a bit of a pain since you might have to reset all the passwords for all users. I've created a new one now and will try to carry on as normal.
hu: Nincs kezdeti vektor a titkosításhoz! Ez sajnos azt jelenti, hogy minden felhasználónak új jelszót kell generálni. Egy új létre lett hozva, és a továbbiakban ez lesz használva nomrál módon.

source: No initialization vector found while trying to decrypt. Aborting!
hu: Nincs kezdeti vektor a visszafejtéshez. Megszakítás!

source: administer aes
hu: aes adminisztrációja

source: view passwords
hu: jelszavak megtekintése

source: AES uninstalled.
hu: Az AES el lett távolítva.

source: Provides AES encryption.
hu: AES titkosítást biztosít.

source: Collapsible box
hu: Összecsukható doboz

source: Wether to show the password as a collapsible box on the user info page (collapsed/hidden by default) or on a separate page with a tab on the user page, or both.
hu: Összecsukható dobozként mutassa a jelszót a felhasználói információs oldalán (alapértelmezés szerint zárt / rejtett), vagy füllel egy különálló oldalon, illetve mindkét módon.

source: Creation of encrypted passwords enabled.
hu: Titkosított jelszavak létrehozása engedélyezve.

source: Creation of encrypted passwords disabled.
hu: Titkosított jelszavak létrehozása tiltva.

source: It appears that phpseclib is installed in the right location but can't be read. Check that the permissions on the directory and its files allows for reading by the webserver.
hu: Úgy tűnik, hogy a „phpseclib” jó helyre van telepítve, de nem olvasható. Ellenőrizni kell a könyvtár és a fájlok jogosultságait, hogy a kiszolgáló tudja olvasni azokat.

source: Check this box if you would like for AES to start encrypting user passwords (and make them viewable to the roles with permission to do so). This is a process which normally will make more and more passwords AES-encrypted/readable over time since the AES module only can get an existing users password in plain text at certain moments, one such moment being when the user logs in. So you won't be able to view an existing users password until that user has logged in at least once after you checked this box. You may test this on yourself by logging out and in again, which should make your password appear on your user page.
hu: A jelölőnégyzetet bekapcsolásával az AES elkezdi titkosítani a felhasználók jelszavait (valamint láthatóvá teszi őket a megfelelő jogosultsággal rendelkező csoportok számára). Ez egy folyamat, amely időről-időre egyre több jelszót titkosít az AES algoritmussal, mivel az AES modul jelenleg csak a létező felhasználók egyszerű szöveges jelszavait tudja titkosítani, ami csak akkor áll rendelkezésre, amikor a felhasználó éppen bejelentkezik. Tehát nem lehet megtekinteni a létező felhasználók jelszavát mindaddig, amíg a felhasználók legalább egyszer be nem jelentkeznek a jelölőnégyzetet bekapcsolása után. Ezt le lehet tesztelni a saját fiókon, kilépés majd ismételt bejelentkezés után a jelszó látható lesz a saját felhasználói oldalon.

source: You do not have an AES implementation installed!
hu: Nincs telepített AES megvalósítás!

source: AES implementation
hu: AES megvalósítás

source: Cipher is locked to Rijndael 128 when using the phpseclib implementation.
hu: A „phpseclib” megvalósításban a rejtjelezés csak „Rijndael 128” lehet.

source: AES needs an encryption implementation to function. See the README.txt for instructions on how to install one.
hu: Az AES modul működéséhez szükség van egy titkosítási megvalósításra. A README.txt fájlban olvasható módon lehet telepíteni egyet.

source: Implementation changed. Re-encrypting all passwords using new implementation.
hu: A megvalósítás megváltozott. Minden jelszó ismételt titkosítása az új megvalósítással.

source: Updated the passwords of !updates_num users because of a change in implementation.
hu: A megvalósítás változása miatt !updates_num felhasználó jelszava frissítve lett.

source: Request was sent to encrypt a string with the AES module, but the AES module has no active encryption implementation to work with! Did you forget to run update.php after upgrading this module?
hu: Egy karaktersorozat titkosítása el lett küldve az AES modulhoz, de az AES modulnak nincs olyan aktív titkosítási megvalósítása, amivel működhetne. A modul frissítése után nem maradt el az update.php futtatása?

source: Request was sent to decrypt a string with the AES module, but the AES module has no active encryption implementation to work with! Did you forget to run update.php after upgrading this module?
hu: Egy karaktersorozat visszafejtése el lett küldve az AES modulhoz, de az AES modulnak nincs olyan aktív titkosítási megvalósítása, amivel működhetne. A modul frissítése után nem maradt el az update.php futtatása?

source: The AES encryption module requires at least one of two things to function: Either the PHP Mcrypt extension has to be installed on the web server. Or the PHP Secure Communications Library (phpseclib) needs to be present in the AES directory. Installing phpseclib is probably the easiest thing to do, you can download a copy at http://phpseclib.sourceforge.net/. Extract the zip file into a directory named "phpseclib" inside the "aes" module directory and you should be good to go. Check the README.txt for more information.
hu: Az AES titkosító modulnak az alábbi két dologból legalább egyre szüksége van a működéshez: A PHP „Mcrypt” kiterjesztésének telepítve kell lennie a kiszolgálóra, vagy a PHP <em>Secure Communications Library</em> („phpseclib”) könyvtárnak jelen kell lennie az AES könyvtárában. A legkönnyebb a „phpseclib” telepítése, mely letölthető a http://phpseclib.sourceforge.net/ webhelyről, és az AES modulon belül egy phpseclib nevű könyvtárba kell kicsomagolni. További információk a README.txt fájlban.

source: Called aes_make_iv when using phpseclib. This is harmless, but shouldn't happen.
hu: Az „aes_make_iv” meghívódott a „phpseclib” használatával. Ez ártalmatlan, de nem kellene megtörténnie.

source: Tried to encrypt an empty string.
hu: Egy üres karaktersorozat titkosításának kísérlete.

source: A custom cipher was defined when encrypting a string in the AES module using the phpseclib implementation. This implementation doesn't support custom ciphers therefore the argument was ignored and the encryption was done with the standard cipher.
hu: Egy egyedi rejtjel van meghatározva ahhoz, hogy az AES modul titkosítsa a karaktersorozatot a „phpseclib” megvalósítással. Ez a megvalósítás nem támogatja az egyedi rejtjeleket, ezért az argumentum figyelmen kívül lett hagyva, és a titkosítás az általános rejtjel segítségével történt meg.

source: A custom IV was defined when encrypting a string in the AES module using the phpseclib implementation. This implementation doesn't support custom IV's therefore the argument was ignored and the encryption was done with the standard IV.
hu: Egy egyedi kezdeti vektor van meghatározva ahhoz, hogy az AES modul titkosítsa a karaktersorozatot a „phpseclib” megvalósítással. Ez a megvalósítás nem támogatja az egyedi kezdeti vektorokat, ezért az argumentum figyelmen kívül lett hagyva, és a titkosítás az általános kezdeti vektor segítségével történt meg.

source: Tried to decrypt an empty string.
hu: Egy üres karaktersorozat visszafejtésének kísérlete.

source: A custom cipher was defined when decrypting a string in the AES module using the phpseclib implementation. This implementation doesn't support custom ciphers therefore the argument was ignored and the decryption was done with the standard cipher.
hu: Egy egyedi rejtjel van meghatározva ahhoz, hogy az AES modul visszafejtse a karaktersorozatot a „phpseclib” megvalósítással. Ez a megvalósítás nem támogatja az egyedi rejtjeleket, ezért az argumentum figyelmen kívül lett hagyva, és a visszafejtés az általános rejtjel segítségével történt meg.

source: A custom IV was defined when decrypting a string in the AES module using the phpseclib implementation. This implementation doesn't support custom IV's therefore the argument was ignored and the decryption was done with the standard IV.
hu: Egy egyedi kezdeti vektor van meghatározva ahhoz, hogy az AES modul visszafejtse a karaktersorozatot a „phpseclib” megvalósítással. Ez a megvalósítás nem támogatja az egyedi kezdeti vektorokat, ezért az argumentum figyelmen kívül lett hagyva, és a visszafejtés az általános kezdeti vektor segítségével történt meg.

source: AES installed using the Mcrypt implementation.
hu: Az AES telepítve lett az „Mcrypt” megvalósítással.

source: AES installed using the phpseclib implementation.
hu: Az AES telepítve lett a „phpseclib” megvalósítással.

source: AES installed without any implementation!
hu: Az AES megvalósítás nélkül lett telepítve!
